app/Controllers/Tasks.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-07'
AND `is_archived` = 0
ORDER BY `id` ASC
---
    public function index()
    {
        $today = date('Y-m-d');

        $data = [
            'title' => "Today's Tasks",
            'today' => $today,
            'tasks' => $this->taskModel
                ->where('task_date', $today)->where('is_archived', 0)
                ->orderBy('id', 'ASC')
                ->findAll()

SELECT *
FROM `tasks`
WHERE `is_archived` = 0
ORDER BY `task_date` ASC, `id` ASC
---
    public function taskList()
    {
        $data = [
            'title' => 'Complete Task List',
            'tasks' => $this->taskModel
                ->where('is_archived', 0)->orderBy('task_date', 'ASC')
                ->orderBy('id', 'ASC')
                ->findAll()

SELECT *
FROM `users`
 LIMIT 1
---
    public function profile()
    {
        $data = [
            'title' => 'User Profile',
            'user' => $this->userModel->first()